
{"duration":"-","courseProvider":"tutsplus.com","courseLink":"http://code.tutsplus.com/courses/getting-started-with-python","price":"-","name":"Getting Started with Python","tname":"-","type":"-","desc":"\u003cp\u003e\n\nIn this course, you\u0026rsquo;ll learn how to use the \u003ca href\u003d\\\"https://www.python.org/\\\"\u003ePython\u003c/a\u003e programming language. We\u0026rsquo;ll begin with the very basics, and then move our way up to creating dynamic webpages and custom applications. We will wrap up the course by discussing how to distribute your Python programs to other developers.\u003c/p\u003e"}
{"duration":"-","courseProvider":"tutsplus.com","courseLink":"http://code.tutsplus.com/courses/getting-started-with-django","price":"-","name":"Getting Started With Django","tname":"-","type":"-","desc":"\u003cp\u003eIf you like the elegance of the Python programming language, Django is the web framework for you! Django is a powerful but pragmatic framework, with an emphasis on getting work done.\u003c/p\u003e\n\u003cp\u003eIn this course, Tuts+ instructor Derek Jensen will help you get started writing web applications using the Django framework. Derek will teach the basics of Django by building a simple chore list application.\u003c/p\u003e\n"}
{"duration":"-","courseProvider":"tutsplus.com","courseLink":"http://code.tutsplus.com/courses/foundational-flask-creating-your-own-static-blog-generator","price":"-","name":"Foundational Flask: Creating Your Own Static Blog Generator","tname":"-","type":"-","desc":"\u003cp\u003e\n\nYou\u0026rsquo;ve no doubt heard of Django\u0026mdash;the go-to web development framework for Python. While Django is a superb framework for developing complex web applications, it can be slightly cumbersome when developing something a bit smaller. Enter \u003ca href\u003d\\\"http://flask.pocoo.org/\\\"\u003eFlask\u003c/a\u003e. It has the ability to grow with the complexity of your app, making it, in many cases, the only framework you\u0026rsquo;ll ever need.\u003c/p\u003e"}
{"duration":"-","courseProvider":"tutsplus.com","courseLink":"http://code.tutsplus.com/courses/crawl-the-web-with-python","price":"-","name":"Crawl the Web With Python","tname":"-","type":"-","desc":"\u003cp\u003eIn a recent business venture, I found it necessary to collect bulk data from different online sources in order to centralize it and make it easier for people to find and to make sense of. None of those sites had exposed public APIs, so I decided to try my hand at a little web crawling and scraping to obtain this metadata. After searching around for a while, I found that many people when faced with the same issue have turned to Python. After all, if it was good enough for Google, it\u0027s definitely good enough for me!\u003c/p\u003e\n\u003cp\u003eIn this course I will share some of my findings and show you how you can go about creating your own basic web crawler and scraper.\u003c/p\u003e\n"}
{"duration":"-","courseProvider":"tutsplus.com","courseLink":"http://code.tutsplus.com/courses/introduction-to-python","price":"-","name":"Introduction to Python","tname":"-","type":"-","desc":"\u003cp\u003ePython is well known as a programming language that is easy to learn. With a simple, expressive syntax, Python is refreshingly free of the gotchas and edge-cases that plague learners of many other languages. Python isn\u0027t just for beginners though! It is an expressive and powerful language that is widely used by professional coders and shops.\u003c/p\u003e\n\u003cp\u003eIn this course, Tuts+ instructor Derek Jensen will introduce the Python language, starting with the basics and laying a solid foundation for future learning.\u003c/p\u003e\n"}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/b0f0430328727c25ab365c118db323f7/","price":"-","name":"SLiMSearch: A Webserver for Finding Novel Occurrences of Short Linear Motifs in Proteins, Incorporating Sequence Context","tname":"-","type":"-","desc":"Short, linear motifs (SLiMs) play a critical role in many biological processes. The SLiMSearch (Short, Linear Motif Search) webserver is a flexible tool that enables researchers to identify novel occurrences of pre-defined SLiMs in sets of  proteins. Numerous masking options give the user great control over the contextual information to be included in the analyses, including evolutionary filtering and protein structural disorder. User-friendly output and visualizations of motif context allow the user to quickly gain insight into the validity of a putatively functional motif occurrence. Users can search motifs against the human proteome, or submit their own datasets of UniProt proteins, in which case motif support within the dataset is statistically assessed for over- and under-representation, accounting for evolutionary relationships between input proteins. SLiMSearch  is freely available as open source Python modules and all webserver results are available for download. The SLiMSearch server is available at: http://bioware.ucd.ie/slimsearch.html."}
{"duration":"-","courseProvider":"University of Cape Town","courseLink":"http://www.ocwconsortium.org/courses/view/8b673c8f7b4744406f0cd526924afcfb/","price":"-","name":"Python for physics","tname":"-","type":"-","desc":"Authors:\u0026nbsp;                     Roger Fearick                         Python is a programming language which is increasingly being used for computation in physics.  Why is this?      * Python is easy to learn.   Clicked 366 times. Last clicked 05/19/2012 - 02:23.                                                         Teaching \u0026amp; Learning Context:\u0026nbsp;                     \u0026lt;p\u0026gt;This is an introduction to the Python programming language for computational physics.\u0026lt;/p\u0026gt;"}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/544c334c9bc3e92009a55047f393f4ee/","price":"-","name":"MAS.110 Fundamentals of Computational Media Design","tname":"-","type":"-","desc":"This class covers the history of 20th century art and design from the perspective of the technologist. Methods for visual analysis, oral critique, and digital expression are introduced. Class projects this term use the OLPC XO (One Laptop Per Child) laptop, Csound and Python software."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/fe1f55a8e57cae06e853e4a7ac1a110a/","price":"-","name":"Scikitlearn","tname":"-","type":"-","desc":"Scikits.learn is a Python module integrating classique machine learning algorithmes in the tightly-nit world of scientific Python packages    It aims to provide simple and efficient solutions to learning problems that are accessible to everybody and reusable in various contexts: machine-learning as a versatile tool for science and engineering."}
{"duration":"-","courseProvider":"University of Cape Town","courseLink":"http://www.ocwconsortium.org/courses/view/fb69e2d1d2d96ed9b8c3f32a46432e36/","price":"-","name":"Introduction to Python Programming, Part 1","tname":"-","type":"-","desc":"\u003cdiv class\u003d\\\"field field-type-text field-field-author\\\"\u003e     \u003cdiv class\u003d\\\"field-items\\\"\u003e             \u003cdiv class\u003d\\\"field-item odd\\\"\u003e                       \u003cdiv class\u003d\\\"field-label-inline-first\\\"\u003e               Authors:\u0026nbsp;\u003c/div\u003e                     Michelle Kuttel        \u003c/div\u003e         \u003c/div\u003e \u003c/div\u003e \u003cdiv class\u003d\\\"weblinks weblinks-item weblinks-link-312\\\"\u003e     \u003cdiv class\u003d\\\"weblinks-body\\\"\u003e \u003cp\u003eThis set of six files comprises the slides from  first 6 weeks of our 12 week first year course on Python Programming. It is an introduction aimed at students who have not programmed before.\u003c/p\u003e \u003c/div\u003e\u003c!--class\u003d\\\"weblinks-body\\\"--\u003e  \u003cdiv class\u003d\\\"weblinks-click-stats\\\"\u003eClicked 421 times. Last clicked 12/20/2013 - 07:05.\u003c/div\u003e\u003c!--class\u003d\\\"weblinks-click-stats\\\"--\u003e\u003c/div\u003e\u003c!--class\u003d\\\"weblinks weblinks-item weblinks-link-312\\\"--\u003e \u003c!-- \u003crdf:RDF xmlns\u003d\\\"http://creativecommons.org/ns#\\\" xmlns:rdf\u003d\\\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\\\"\u003e \u003cwork rdf:about\u003d\\\"http://opencontent.uct.ac.za/Science/Introduction-to-Python-Programming-Part-1\\\"\u003e \u003clicense rdf:resource\u003d\\\"http://creativecommons.org/licenses/by-sa/2.5/za/\\\" /\u003e \u003c/work\u003e \u003clicense rdf:about\u003d\\\"http://creativecommons.org/licenses/by-sa/2.5/za/\\\"\u003e \u003crequires rdf:resource\u003d\\\"http://creativecommons.org/ns#Attribution\\\" /\u003e \u003crequires rdf:resource\u003d\\\"http://creativecommons.org/ns#Notice\\\" /\u003e \u003crequires rdf:resource\u003d\\\"http://creativecommons.org/ns#ShareAlike\\\" /\u003e \u003cpermits rdf:resource\u003d\\\"http://creativecommons.org/ns#DerivativeWorks\\\" /\u003e \u003cpermits rdf:resource\u003d\\\"http://creativecommons.org/ns#Distribution\\\" /\u003e \u003cpermits rdf:resource\u003d\\\"http://creativecommons.org/ns#Reproduction\\\" /\u003e \u003c/license\u003e \u003c/rdf:RDF\u003e --\u003e\u003cdiv class\u003d\\\"field field-type-text field-field-tlcontext\\\"\u003e     \u003cdiv class\u003d\\\"field-items\\\"\u003e             \u003cdiv class\u003d\\\"field-item odd\\\"\u003e                       \u003cdiv class\u003d\\\"field-label-inline-first\\\"\u003e               Teaching \u0026amp; Learning Context:\u0026nbsp;\u003c/div\u003e                     A first half of a first course on how to program in Python.        \u003c/div\u003e         \u003c/div\u003e \u003c/div\u003e"}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/f9a9f422835e04d9693666744005236c/","price":"-","name":"Lecture 25: Rewriting RSG to Illustrate all Three Paradigms and Lambdas in Python","tname":"-","type":"-","desc":"What I want to do today is I want to focus a little bit more on dictionaries and show you  an example where dictionaries actually contribute to a meaningful program. I\u0027m gonna rewrite  RSG from a sign of one in Python. We\u0027re gonna do it in laughably little space. I\u0027m  gonna be able to illustrate a very small program that has the imperative, object oriented,  and the functional paradigm all in it. ...    See the whole transcript at [[http://see.stanford.edu/materials/icsppcs107/transcripts/ProgrammingParadigms-Lecture25.pdf|Programming Paradigms - Lecture 25]]"}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/4c9febdaf380b4862920618226ed46bc/","price":"-","name":"Lecture 1: Object-Oriented Programming","tname":"-","type":"-","desc":"In this session, we introduce you to some of the core concepts of 6.01. We will also focus on programming, in particular the object-oriented programming paradigm in Python. Topics include primitives, expressions, assignments, functions, environments, OOP, and inheritance.    The overview handout provides a more detailed introduction, including the big ideas of the session, key vocabulary, what you should understand (theory) and be able to do (practice) after completing this session, and additional resources."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/6a1bb7bacfe6bdf8065bfe7a6ad23dd9/","price":"-","name":"Lecture 4: Machine Interpretation of a Program","tname":"-","type":"-","desc":"This lecture introduces the notion of decomposition and abstraction by specification. It also covers Python modules, functions, parameters, and scoping. Finally, it uses the Python assert statement and type \u0027str\u0027.    Topics covered: Decomposition, module, function, abstraction, formal parameter, actual parameter, argument, assert, scope, mapping, stack, last in first out, LIFO, strings, slicing."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/9790440f6281a19e2691ef04c764a1ff/","price":"-","name":"Open Bank Project","tname":"-","type":"-","desc":"TESOBE builds web applications, API\u0027s and mobile applications using technologies such as Python/Django, Scala/Lift, Node.js, Postgres and MongoDB, and is founder of the openbankproject.com. The Open Bank Project is an open source API for banks that seeks to \\\"raise the bar of financial transparency\\\" and facilitate application and data innovation in the banking domain."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/f7be141b2cd627259cb89afa9ef0820a/","price":"-","name":"Lecture 23: Scheme Memory Model - How Scheme Instructions Synthesize Linked Lists Behind the Scenes and Perform Operations on Them","tname":"-","type":"-","desc":"Once I get to the Scheme segment, we\u0027re going to transition and lighten a little bit and  we\u0027re not going to be so concerned about trying to master all these new features of  language, because I don\u0027t want to say we\u0027ve covered all of paradigms, that\u0027s not true. But  we\u0027ve covered a good number of paradigms, and when I teach Python next, I\u0027m going to  really just highlight individual things in the language that will get you up and running  very quickly and point out where it\u0027s imperative and where it\u0027s object-oriented and where  it\u0027s functional, okay? ...    See the whole transcript at [[http://see.stanford.edu/materials/icsppcs107/transcripts/ProgrammingParadigms-Lecture23.pdf|Programming Paradigms - Lecture 23]]"}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/da2f520d69e523c7e8341f3263e5a24f/","price":"-","name":"PyBrain","tname":"-","type":"-","desc":"PyBrain is a versatile machine learning library for Python. Its goal is to provide flexible, easy-to-use yet still powerful algorithms for machine learning tasks, including a variety of predefined environments and benchmarks to test and compare algorithms. Implemented algorithms include Long Short-Term Memory (LSTM), policy gradient methods, (multidimensional) recurrent neural networks and evolution strategies like CMA-ES, NES or FEM."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/62ae84dbb026d16f3f47d60031501628/","price":"-","name":"Nieme","tname":"-","type":"-","desc":"Nieme is a machine learning library for large-scale classi?cation, regression and ranking. It relies on the framework of energy-based models which uni?es several learning algorithms ranging from simple perceptrons  to recent models such as the Pegasos support vector machine or L1-regularized maximum entropy models.  This framework also uni?es batch and stochastic learning which are both seen as energy minimization  problems. Nieme can hence be used in a wide range of situations, but is particularly interesting for very-  large-scale learning tasks where both the examples and the features are processed incrementally. Being able  to deal with new incoming features at any time within the learning process is another key feature of the  Nieme toolbox. Nieme is released under the GPL license. It is e?ciently implemented in C++ and works  on Linux, MacOS and Windows. Interfaces are available for C++, Java and Python."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/be68149c04e7d0140a258c48bb77ddbe/","price":"-","name":"20.453J / 2.771J / HST.958J Biomedical Information Technology","tname":"-","type":"-","desc":"This course teaches the design of contemporary information systems for biological and medical data. Examples are chosen from biology and medicine to illustrate complete life cycle information systems, beginning with data acquisition, following to data storage and finally to retrieval and analysis. Design of appropriate databases, client-server strategies, data interchange protocols, and computational modeling architectures. Students are expected to have some familiarity with scientific application software and a basic understanding of at least one contemporary programming language (e.g. C, C++, Java, Lisp, Perl, Python). A major term project is required of all students. This subject is open to motivated seniors having a strong interest in biomedical engineering and information system design with the ability to carry out a significant independent project. This course was offered as part of the Singapore-MIT Alliance (SMA) program as course number SMA 5304."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/06be36d67691ac966ace07fd9a5ca3b9/","price":"-","name":"Machine Learning Py (mlpy)","tname":"-","type":"-","desc":"We introduce mlpy, a high-performance Python package for predictive modeling. It makes extensive use of  NumPy to provide fast N-dimensional array manipulation and easy integration of C code. Mlpy provides high  level procedures that support, with few lines of code, the design of rich Data Analysis Protocols (DAPs) for  predictive classi?cation and feature selection. Methods are available for feature weighting and ranking, data  resampling, error evaluation and experiment landscaping. The package includes tools to measure stability  in sets of ranked feature lists, of special interest in bioinformatics for functional genomics, for which large  scale experiments with up to 106 classi?ers have been run on Linux clusters and on the Grid."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/7e4f1793548e237b137a33dc3366d04f/","price":"-","name":"Lecture 9: Memory and Search Methods","tname":"-","type":"-","desc":"This lecture discusses how indirection is used to provide an efficient implementation of Python lists and other data structures. It also presents and analyzes the efficiency of selection and merge sort.    Topics covered: Memory, storage, indirection, sorting."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/d531e174af8ce48eb348cb7e08310bc4/","price":"-","name":"Lecture 24: Overarching Features of Python: Scripting Language","tname":"-","type":"-","desc":"Okay, so this thing called Python. Oops, let’s spell it right. There are two overarching features  that I want to emphasize. It is as opposed to anything you’ve seen before, Scheme you  could argue is a little bit like this, but C and C++ and Java are certainly not. It’s an  example of what’s called a scripting language. ...    See the whole transcript at [[http://see.stanford.edu/materials/icsppcs107/transcripts/ProgrammingParadigms-Lecture24.pdf|Programming Paradigms - Lecture 24]]"}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/d9617d5d27d2de323f4f474f573a69ee/","price":"-","name":"6.088 Introduction to C Memory Management and C++ Object-Oriented Programming","tname":"-","type":"-","desc":"Ever hang your head in shame after your Python program wasn\u0027t as fast as your friend\u0027s C program? Ever wish you could use objects without having to use Java? Join us for this fun introduction to C and C++! We will take you through a tour that will start with writing simple C programs, go deep into the caves of C memory manipulation, resurface with an introduction to using C++ classes, dive deeper into advanced C++ class use and the C++ Standard Template Libraries. We\u0027ll wrap up by teaching you some tricks of the trade that you may need for tech interviews. We see this as a \\\"C/C++ empowerment\\\" course: we want you to come away understanding why you would want to use C over another language (control over memory, probably for performance reasons), why you would want to use C++ rather than C (objects), and how to be useful in C and C++. This course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/ce96f7ee70f377f55d3f31c27a8f6928/","price":"-","name":"6.00SC Introduction to Computer Science and Programming (MIT)","tname":"-","type":"-","desc":"This subject is aimed at students with little or no programming experience. It aims to provide students with an understanding of the role computation can play in solving problems. It also aims to help students, regardless of their major, to feel justifiably confident of their ability to write small programs that allow them to accomplish useful goals. The class will use the Python programming language."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/a101ef4799d29b948d4481801933dd8a/","price":"-","name":"Lecture 2: Primitives, Combination, Abstraction, and Patterns","tname":"-","type":"-","desc":"n this session, we expand on programming, introducing other programming paradigms and indicating features of Python that tie in to notable programming concepts.    We also introduce state machines. State machines model systems that are functional, but also have memory. State machines are incredibly general, but incredibly powerful, and can be used to model all kinds of systems, as you\u0027ll see in future sessions. You can use state machines to control, model, and predict behaviors in systems.    The overview handout provides a more detailed introduction, including the big ideas of the session, key vocabulary, and what you should understand (theory) and be able to do (practice) after completing this session."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/33c210cec95acb1501743083ecfbdfe5/","price":"-","name":"6.00 Introduction to Computer Science and Programming","tname":"-","type":"-","desc":"This subject is aimed at students with little or no programming experience. It aims to provide students with an understanding of the role computation can play in solving problems. It also aims to help students, regardless of their major, to feel justifiably confident of their ability to write small programs that allow them to accomplish useful goals. The class will use the Python™ programming language."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/be39213cda7d9cf6242d70675d099dfb/","price":"-","name":"6.883 Pervasive Human Centric Computing (SMA 5508)","tname":"-","type":"-","desc":"This course is broad, covering a wide range of topics that have to do with the post-pc era of computing. It is a hands-on project course that also includes some foundational subjects. Students will program iPAQ handheld computers, cell phones (series 60 phones), speech processing, vision, Cricket location systems, GPS, and more. Most of the programming will be using Python®, but Python® can be learned and mastered during the course. This course was also taught as part of the Singapore-MIT Alliance (SMA) programme as course number SMA 5508 (Pervasive Computing)."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/67641e0a33560e9642dcc0f793d88875/","price":"-","name":"RL Glue and Codecs Glue","tname":"-","type":"-","desc":"RL-Glue is a protocol and software implementation for evaluating reinforcement learning algorithms. Our  system facilitates the comparison of alternative algorithms and can greatly accelerate research progress as  the UCI database has accelerated progress in supervised machine learning. Creating a comparable bench-  marking resource for reinforcement learning is challenging because of the temporal nature of reinforcement  learning. Reinforcement learning agents interact with a dynamic process (the environment) which gener-  ates observations and rewards. The observations and rewards received by the learning agent depend on the actions; training data cannot simply be stored in a ?le as they are in supervised learning. Instead, the rein-  forcement learning agent and environment must be interacting programs. RL-Glue agents and environments  can be written in Java, C/C++, Matlab, Python, and Lisp and can all run on one machine, or can connect  across the Internet. In this seminar, we will introduce the design principles that helped shape RL-Glue  and demonstrate some of the interesting extensions that have been created by the reinforcement learning  community."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/6894e4b6fa8e2c8356a265f9cade2b64/","price":"-","name":"Lecture 11: OOP and Inheritance","tname":"-","type":"-","desc":"In this lecture, we learn about object-oriented programming (OOP) and how classes are used to implement new types of objects in Python. As part of that discussion we introduce inheritance.    Topics covered: Object-oriented programming (OOP), abstract data types, specifications, subclasses, inheritance."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/ce8235c6ae4f2f763ea5c1e71a0ddcd6/","price":"-","name":"Introduction to MATLAB","tname":"-","type":"-","desc":"This course was offered as a non-credit program during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month. The course, intended for students with no programming experience, provides the foundations of programming in MATLAB®. Variables, arrays, conditional statements, loops, functions, and plots are explained. At the end of the course, students should be able to use MATLAB in their own work, and be prepared to deepen their MATLAB programming skills and tackle other languages for computing, such as Java, C++, or Python. The course mostly follows the official MATLAB Manual, available from The MathWorks. We will cover material from chapters 2-5. Technical Requirements:Special software is required to use some of the files in this course: .m."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/ac063fb6ebe1e9447adec68cd7e559b2/","price":"-","name":"Metabolite identification and molecular fingerprint prediction via machine learning","tname":"-","type":"-","desc":"**Motivation:** Metabolite identification from tandem mass spectra is an important problem in  metabolomics, underpinning subsequent metabolic modelling and network analysis. Yet, currently  this task requires matching the observed spectrum against a database of reference spectra  originating from similar equipment and closely matching operating parameters, a condition that is  rarely satisfied in public repositories. Furthermore, the computational support for identification of  molecules not present in reference databases is lacking. Recent efforts in assembling large public  mass spectral databases such as MassBank have opened the door for the development of a new  genre of metabolite identification methods.\\  **Results:** We introduce a novel framework for prediction of molecular characteristics and  identification of metabolites from tandem mass spectra using machine learning with the support  vector machine (SVM). Our approach is to first predict a large set of molecular properties of the  unknown metabolite from salient tandem mass spectral signals, and in the second step to use the  predicted properties for matching against large molecule databases, such as PubChem. We  demonstrate that several molecular properties can be predicted to high accuracy, and that they  are useful in de novo metabolite identification, where the reference database does not contain any  spectra of the same molecule.\\  **Availability:** An Matlab/Python package of the FingerID tool is freely available on the web at  http://www.sourceforge.net/p/fingerid."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/45ebc8628f75a3cd3820e55a740402f9/","price":"-","name":"Introduction to MATLAB","tname":"-","type":"-","desc":"\u003cp\u003eThis is a free, online textbook that is used in conjunction with MIT\u0027s OpenCourseWare.  It is \\\"intended for students with no programming experience, provides the foundations of programming in MATLAB®. Variables, arrays, conditional statements, loops, functions, and plots are explained. At the end of the course, students should be able to use MATLAB in their own work, and be prepared to deepen their MATLAB programming skills and tackle other languages for computing, such as Java, C++, or Python.?\u003c/p\u003e"}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/9152af534f2f9cec994c370d5fef8f24/","price":"-","name":"Matplotlib","tname":"-","type":"-","desc":"matplotlib is a python 2D plotting library which produces publication quality ?gures in a variety of hardcopy  formats and interactive environments across platforms. matplotlib can be used in python scripts, the python  and ipython shell (ala matlab or mathematica), web application servers, and works with six graphical user  interface toolkits. matplotlib tries to make easy things easy and hard things possible. You can generate  plots, histograms, power spectra, bar charts, error charts, scatter plots, etc, with just a few lines of code.  For the power user, you have full control of line styles, font properties, axes properties, etc, via an object  oriented interface or via a handle graphics interface familiar to matlab users."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/636b0b9d3e2d9194202f03b5f190a0e3/","price":"-","name":"Lecture 26: XML Processing and Python - Two Different XML Processing Models","tname":"-","type":"-","desc":"It\u0027s pretty lightweight, but nonetheless, go to the discussion section tomorrow if you have  any more curiosity about Python. I\u0027m really regretting not having more time for Python  because I think it\u0027s such a fun little language. But we\u0027ve already learned all the paradigms  that I wanna go over, so we\u0027re just looking at Python as a representative of all three of  them. As far as the final exam is concerned, remember it\u0027s a week from today. I can\u0027t say  it enough, but there\u0027s no Python on the final, but everything up to the last lecture of  Scheme through the entire quarter is fair game. ...    See the whole transcript at [[http://see.stanford.edu/materials/icsppcs107/transcripts/ProgrammingParadigms-Lecture26.pdf|Programming Paradigms - Lecture 26]]"}
{"duration":"-","courseProvider":"University of Michigan","courseLink":"http://www.ocwconsortium.org/courses/view/6b69bc72e52fe3d5916418e699122445/","price":"-","name":"SI / Coursera - Programming for Everybody","tname":"-","type":"-","desc":"\u003cdiv class\u003d\\\"field field-type-text field-field-content-type\\\"\u003e       \u003cdiv class\u003d\\\"field-label\\\"\u003eContent Type:\u0026nbsp;\u003c/div\u003e     \u003cdiv class\u003d\\\"field-items\\\"\u003e             \u003cdiv class\u003d\\\"field-item odd\\\"\u003e                     Course        \u003c/div\u003e         \u003c/div\u003e \u003c/div\u003e \u003cdiv class\u003d\\\"field field-type-text field-field-course-code\\\"\u003e       \u003cdiv class\u003d\\\"field-label\\\"\u003eShort Title/Course Code:\u0026nbsp;\u003c/div\u003e     \u003cdiv class\u003d\\\"field-items\\\"\u003e             \u003cdiv class\u003d\\\"field-item odd\\\"\u003e                     coursera-programming-for-everybody        \u003c/div\u003e         \u003c/div\u003e \u003c/div\u003e \u003cp variable\u003d\\\"http://purl.org/dc/elements/1.1/variable#\\\"\u003eThis course teaches basic Python programming skills through data analysis. There is no complex math in the course, the programs are generally quite short, and the workload is no more than a few hours per week. By the time you complete the course, you will understand and be able to read, parse, and manipulate data using Python. The course is also being packaged as a \u0026quot;remixer kit\u0026quot; to be used by instructors and/or learners who want to remix or change any of these materials.\u003c/p\u003e \u003cp variable\u003d\\\"http://purl.org/dc/elements/1.1/variable#\\\"\u003e\u003cstrong\u003eCourse Audience\u003c/strong\u003e\u003cbr /\u003e \t\u003cspan\u003eThis course has no prerequisites. Literally anyone can and everyone should take this course.\u003c/span\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eWhat You Will Learn\u003c/strong\u003e\u003cbr /\u003e \t\u003cspan\u003eUpon completing this course you will have basic Python programming skills. Hopefully you will like programming well enough to take another course in programming or web development.\u003c/span\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eRegister:\u003c/strong\u003e\u003cspan\u003e Visit the \u003ca href\u003d\\\"https://www.coursera.org/course/pythonlearn\\\"\u003ecourse\u0027s site\u003c/a\u003e to register for and participate in this class.\u003c/span\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eInstructor: \u003c/strong\u003e\u003cspan\u003eCharles Severance\u003c/span\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eCourse Level:\u003c/strong\u003e\u003cspan\u003e Undergraduate\u003c/span\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eAvailable on:\u003c/strong\u003e\u003cspan\u003e \u003ca href\u003d\\\"https://www.coursera.org/course/pythonlearn\\\"\u003eCoursera\u003c/a\u003e and \u003c/span\u003e\u003ca href\u003d\\\"https://online.dr-chuck.com/\\\"\u003eDr. Chuck Online\u003c/a\u003e\u003c/p\u003e \u003cfieldset class\u003d\\\"fieldgroup group-instructor\\\"\u003e\u003clegend\u003eInstructor\u003c/legend\u003e\u003cdiv class\u003d\\\"field field-type-nodereference field-field-course-instructor\\\"\u003e       \u003cdiv class\u003d\\\"field-label\\\"\u003eCourse Instructor:\u0026nbsp;\u003c/div\u003e     \u003cdiv class\u003d\\\"field-items\\\"\u003e             \u003cdiv class\u003d\\\"field-item odd\\\"\u003e                     \u003ca href\u003d\\\"http://open.umich.edu/instructor/charles-severance\\\"\u003eCharles Severance\u003c/a\u003e        \u003c/div\u003e         \u003c/div\u003e \u003c/div\u003e \u003c/fieldset\u003e"}
{"duration":"-","courseProvider":"University of Cape Town","courseLink":"http://www.ocwconsortium.org/courses/view/d9baed1356597838a732ed8afe7798e7/","price":"-","name":"DemOnline","tname":"-","type":"-","desc":"                                                        Authors:\u0026nbsp;                     Andy Buffler, Michael Malahe                         The website catalogues both lecture demonstrations  and VPython scripts.   Clicked 75 times. Last clicked 05/13/2012 - 20:58.                                                         Teaching \u0026amp; Learning Context:\u0026nbsp;                     \u0026lt;p\u0026gt;DemOnline is a collection of demonstrations and VPython scripts for use in an introductory physics course.\u0026lt;/p\u0026gt;                  "}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/831931d5c31e9cb94e0e2458b19ec000/","price":"-","name":"Lecture 5: Objects in Python","tname":"-","type":"-","desc":"This lecture introduces Python tuples, lists, and dictionaries, as well as the concept of mutability and how to avoid problems relating to it.    Topics covered: Tuples, lists, dictionaries, methods, identifiers, modifying objects, aliasing, mutability."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/bbf535483357c518eb5bd9a2fb930861/","price":"-","name":"BCPy2000","tname":"-","type":"-","desc":"BCPy2000  Jeremy Hill, Max-Planck-Institute for Biological Cybernetics, T¨ ubingen, Germany  BCPy2000 provides a platform for rapid, ?exible development of experimental Brain-Computer Interface  systems based on the BCI2000.org project. From the developer’s point of view, the implementation is  carried out in Python, taking advantage of various high-level packages: VisionEgg for stimulus presentation,  NumPy and SciPy for signal processing and classi?cation, and IPython for interactive debugging. BCPy2000  implements a lot of infrastructure allowing you to get new experiments up and running quickly. It also  contains a set of optional tools, which are still a work in progress but which are rapidly turning into a  kind of “standard library” of object-oriented signal-processing and stimulus widgets. These features make  it a ?exible platform for developers of new NumPy/SciPy-based machine-learning algorithms in the ?eld of  realtime biosignal analysis."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/35ed486c963cc82202357d3da4643b7a/","price":"-","name":"MDP – Modular toolkit for Data Processing","tname":"-","type":"-","desc":"Modular toolkit for Data Processing (MDP) is a Python data processing framework. From the user’s per- spective, MDP is a collection of supervised and unsupervised learning algorithms and other data processing units that can be combined into data processing sequences and more complex feed-forward network archi- tectures. From the scienti?c developer’s perspective, MDP is a modular framework, which can easily be expanded.   The implementation of new algorithms is easy and intuitive. The new implemented units are then automatically integrated with the rest of the library. The base of available algorithms is steadily in- creasing and includes, to name but the most common, Principal Component Analysis (PCA and NIPALS), several Independent Component Analysis algorithms (CuBICA, FastICA, TDSEP, and JADE), Slow Feature Analysis, Gaussian Classi?ers, Restricted Boltzmann Machine, and Locally Linear Embedding."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/8c636efe8482916863cfa12f55309544/","price":"-","name":"6.189 A Gentle Introduction to Programming Using Python","tname":"-","type":"-","desc":"This course will provide a gentle introduction to programming using Python™ for highly motivated students with little or no prior experience in programming computers. The course will focus on planning and organizing programs, as well as the grammar of the Python programming language. Lectures will be interactive featuring in-class exercises with lots of support from the course staff. This course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/fdafe27d1807ebe4685cc9f1a28c3aa7/","price":"-","name":"6.189 A Gentle Introduction to Programming Using Python","tname":"-","type":"-","desc":"This 6-unit P/D/F course will provide a gentle introduction to programming using Python for highly motivated students with little or no prior experience in programming computers over the first two weeks of IAP. The course will focus on planning and organizing programs, as well as the grammar of the Python programming language. Lectures will be interactive, featuring in-class exercises with lots of support from the course staff. This class is designed to help prepare students for 6.01 Introduction to EECS I. 6.01 assumes some knowledge of Python upon entering; the course material for 6.189 has been specially designed to make sure that concepts important to 6.01 are covered. This course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month."}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/2d0e1cc446bd977865312763e8242537/","price":"-","name":"6.189 A Gentle Introduction to Programming Using Python (MIT)","tname":"-","type":"-","desc":"This course will provide a gentle, yet intense, introduction to programming using Python for highly motivated students with little or no prior experience in programming. The course will focus on planning and organizing programs, as well as the grammar of the Python programming language. The course is designed to help prepare students for 6.01 Introduction to EECS I. 6.01 assumes some knowledge of Python upon entering; the course material for 6.189 has been specially designed to make sure that concepts important to 6.01 are covered. This course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month."}
{"duration":"-","courseProvider":"VideoLectures.net","courseLink":"http://www.ocwconsortium.org/courses/view/6e5683404082967fae38074a1e14b270/","price":"-","name":"Mala šola teorije programskih jezikov","tname":"-","type":"-","desc":"Mnogi dosežki teorije programskih jezikov so slabo znani in se le po?asi širijo v ra?unalniško prakso. Tako programerji sploh ne poznajo orodij, ki so jim na voljo, ali pa jih zaradi popularnih govoric in zastarelega znanja zavra?ajo. Po drugi strani programski jeziki, ki se uporabljajo v praksi (C/C++, Java, Perl, Python), vsebujejo nepravilno in polovi?arsko implementirane konstrukte, industrija pa jih \\\"izboljšuje\\\" z lepotnimi predelavami in vsiljevanjem objektnega programiranja kot dokon?ne rešitve vseh programerskih težav.    V mali šoli teorije programskih jezikov bomo govorili o osnovnih principih programskih jezikov in o osnovnih programskih konstruktih, kot so produkti, vsote, funkcije, polimorfizem, vzorci, moduli, funktorji, itn. Vso teorijo bomo podprli s primeri iz znanih programskih jezikov, ko pa le-ti ne bodo zadoš?ali, bomo pokazali primere iz programskega jezika **Ocaml**."}
{"duration":"-","courseProvider":"Paris Tech","courseLink":"http://www.ocwconsortium.org/courses/view/160d8c6557d01399c0b058fe551d9343/","price":"-","name":"Site Libre Savoirs: Climate - Knowledge \u0026 Innovation Community","tname":"-","type":"-","desc":"Domaine: Sciences de la vie et ingénierie du vivant\u003cbr /\u003eMonitoring CH4 emissions from farmhouses and cows by Yves Python       N2O emissions from crops (monitoring, processes, mitigation) by B.Gabrielle       Low-C cropping systems by PietroGoglio       Energy crops (miscanthus, switchgrass) and bioenergy by B.Gabrielle and S.Carton"}
{"duration":"-","courseProvider":"Massachusetts Institute of Technology","courseLink":"http://www.ocwconsortium.org/courses/view/4ec711b683480898b63eca795b407636/","price":"-","name":"21M.380 Music and Technology: Algorithmic and Generative Music (MIT)","tname":"-","type":"-","desc":"This course examines the history, techniques, and aesthetics of mechanical and computer-aided approaches to algorithmic music composition and generative music systems. Through creative hands-on projects, readings, listening assignments, and lectures, students will explore a variety of historical and contemporary approaches. Diverse tools and systems will be employed, including applications in Python, MIDI, Csound, SuperCollider, and Pure Data."}